[
  {
    "id": 1,
    "blobType": 2,
    "titleBlobType": 1,
    "blob_x": "70",
    "blob_x_ff": "70",
    "blob_y": "20",
    "t_blob_x": "40",
    "t_blob_y": "40",
    "m_blob_x": "80",
    "m_blob_x_ff": "80",
    "m_blob_y": "90",
    "image_x": "40px",
    "image_y": "30px",
    "image_scale": "1.7",
    "image_x_mob": "-40px",
    "image_y_mob": "-40px",
    "image_scale_mob": "1.25",
    "image_x_mob_sm": "10px",
    "image_y_mob_sm": "0px",
    "image_scale_mob_sm": "1.7",
    "name": "Aaron",
    "surname": "Cruz",
    "x_link": "https://x.com/mraaroncruz",
    "git_link": "https://github.com/mraaroncruz",
    "web_link": "https://linktr.ee/mraaroncruz",
    "bio": "Aaron is a Freelance Elixir Developer who streams coding on twitch https://linktr.ee/mraaroncruz. Elixir Vienna organizer. Runner. Ex-cook.",
    "talk_title": "Elixir in Real-Time Race Coordination",
    "talk_description": "Building a running race app presents unique challenges, particularly around ensuring data arrives in the correct order to maintain fairness in race results. While GenServers are invaluable for synchronizing data streams, they can become bottlenecks if not managed properly. Testing such systems adds another layer of complexity, often requiring extensive setup to test individual modules. This talk explores these challenges in depth, sharing real-world examples and practical solutions to streamline development and testing in such intricate systems.",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 2,
    "blobType": 0,
    "titleBlobType": 2,
    "blob_x": "190",
    "blob_x_ff": "190",
    "blob_y": "-180",
    "t_blob_x": "200",
    "t_blob_y": "40",
    "m_blob_x": "230",
    "m_blob_x_ff": "230",
    "m_blob_y": "100",
    "image_x": "-110px",
    "image_y": "-50px",
    "image_scale": "0.8",
    "image_x_mob": "-150px",
    "image_y_mob": "-110px",
    "image_scale_mob": "0.6",
    "image_x_mob_sm": "-100px",
    "image_y_mob_sm": "-60px",
    "image_scale_mob_sm": "0.8",
    "name": "Andre",
    "surname": "Albuquerque",
    "x_link": "https://x.com/lejboua",
    "git_link": "https://github.com/amalbuquerque",
    "web_link": "",
    "bio": "André Albuquerque is a staff backend engineer at Remote who co-authored the Mastering Elixir book. He uses Elixir every day to develop and scale the Remote platform, currently with a focus on the Fintech area. He has a master's degree in distributed systems and software engineering. In his time off, he likes to build his own keyboards, practice obstacle course racing, and spend time with his wife and five kids.",
    "talk_title": "The Journey of an Elixir Monolith or How We Arrived at >2M Lines of Code",
    "talk_description": "Join us in the Remote journey from a handful of engineers to >120 backend engineers working within an Elixir monolith with more than 2 million lines of code. You will understand how we scaled our development process, the hard-earned lessons we got, and the improvements we had to make to get here. This talk aims to describe the growth path of our Elixir monolith, the patterns that served us well and the hard-earned lessons that we got along the way.During this time, our monolith allowed us to a single main product to a multi-product.",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 3,
    "blobType": 0,
    "titleBlobType": 3,
    "blob_x": "-40",
    "blob_x_ff": "-40",
    "blob_y": "50",
    "t_blob_x": "30",
    "t_blob_y": "40",
    "m_blob_x": "80",
    "m_blob_x_ff": "80",
    "m_blob_y": "100",
    "image_x": "-110px",
    "image_y": "-50px",
    "image_scale": "0.9",
    "image_x_mob": "-150px",
    "image_y_mob": "-120px",
    "image_scale_mob": "0.7",
    "image_x_mob_sm": "-90px",
    "image_y_mob_sm": "-40px",
    "image_scale_mob_sm": "0.9",
    "name": "Andrea",
    "surname": "Leopardi",
    "x_link": "https://x.com/whatyouhide",
    "git_link": "https://github.com/whatyouhide",
    "web_link": "https://andrealeopardi.com/",
    "bio": "Andrea is a human born in the ancient lands of central Italy. He loves programming, writing, and learning stuff. He’s a software architect, speaker, and member of the core team of the Elixir programming language. He also co-wrote a book about testing in Elixir. His weak spot is having red hair.",
    "talk_title": "TBD",
    "talk_description": "",
    "workshop_title": "Concurrent Data Processing in Elixir",
    "workshop_description": "Consuming data and processing it is a central problem in so many systems nowadays. And Elixir is just so good at doing that, and doing it concurrently! Whether you run an event-sourced architecture with applications that react to events, or you have the occasional use case of map/reducing over collections in an optimized way, Elixir has your back. The current ecosystem is full of fantastic tools to help with these problems: GenStage, Broadway, Flow."
  },
  {
    "id": 4,
    "blobType": 1,
    "titleBlobType": 4,
    "blob_x": "40",
    "blob_x_ff": "40",
    "blob_y": "-160",
    "t_blob_x": "30",
    "t_blob_y": "0",
    "m_blob_x": "75",
    "m_blob_x_ff": "75",
    "m_blob_y": "100",
    "image_x": "-45px",
    "image_y": "-40px",
    "image_scale": "0.96",
    "image_x_mob": "-100px",
    "image_y_mob": "-90px",
    "image_scale_mob": "0.75",
    "image_x_mob_sm": "-55px",
    "image_y_mob_sm": "-40px",
    "image_scale_mob_sm": "0.9",
    "name": "Bruce",
    "surname": "Tate",
    "x_link": "https://x.com/redrapids",
    "git_link": "https://github.com/batate",
    "web_link": "https://grox.io/",
    "bio": "Bruce Tate lives in Chattanooga, Tennessee. An avid adventurer, he enjoys kayaking rivers, indoor climbing, and boating. He has actively participated in the launch of three companies and served as the CTO of icanmakeitbetter. With a strong focus on education, Bruce is an author of over a dozen books and a prominent figure in the Elixir community as a speaker, author, editor, and conference organizer. In 2018, he founded Groxio, a platform dedicated to teaching computer languages. Bruce Tate's contributions in the field of programming education have made a significant impact nationally and beyond.",
    "talk_title": "TBD",
    "talk_description": "",
    "workshop_title": "TBD",
    "workshop_description": ""
  },
  {
    "id": 5,
    "blobType": 2,
    "titleBlobType": 5,
    "blob_x": "170",
    "blob_x_ff": "170",
    "blob_y": "50",
    "t_blob_x": "160",
    "t_blob_y": "20",
    "m_blob_x": "200",
    "m_blob_x_ff": "200",
    "m_blob_y": "130",
    "image_x": "-100px",
    "image_y": "-60px",
    "image_scale": "0.9",
    "image_x_mob": "-150px",
    "image_y_mob": "-100px",
    "image_scale_mob": "0.7",
    "image_x_mob_sm": "-80px",
    "image_y_mob_sm": "-50px",
    "image_scale_mob_sm": "0.9",
    "name": "Hugo",
    "surname": "Baraúna",
    "x_link": "https://x.com/hugobarauna",
    "git_link": "https://github.com/hugobarauna",
    "web_link": "",
    "bio": "Hugo is a developer advocate at Livebook. He’s also the founder of Elixir Radar. Before that, he co-founded Plataformatec, the company where Elixir was created.",
    "talk_title": "TBD",
    "talk_description": "",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 6,
    "blobType": 2,
    "titleBlobType": 6,
    "blob_x": "180",
    "blob_x_ff": "180",
    "blob_y": "-120",
    "t_blob_x": "190",
    "t_blob_y": "10",
    "m_blob_x": "200",
    "m_blob_x_ff": "200",
    "m_blob_y": "140",
    "image_x": "-110px",
    "image_y": "70px",
    "image_scale": "1.4",
    "image_x_mob": "-150px",
    "image_y_mob": "-20px",
    "image_scale_mob": "1.05",
    "image_x_mob_sm": "-50px",
    "image_y_mob_sm": "30px",
    "image_scale_mob_sm": "1.4",
    "name": "Julia",
    "surname": "Mathias",
    "x_link": "https://x.com/thejuliams",
    "git_link": "",
    "web_link": "",
    "bio": "Journey spanning roles in design, documentary research, and even assisting as an art director, before diving into coding in 2021. She found her stride with Elixir and now builds real-time systems at Turn.io, where she’s passionate about using technology to make a tangible difference. At Turn.io, Julia works across a variety of projects, creating solutions that connect people to essential support—whether in crisis counseling, healthcare, or community engagement—when it matters most. Outside of code, Julia is a ballet enthusiast, a Formula 1 fan, and a newly rediscovered poet. And for the record, she’s not a 1D fan, but she does love BTS! (Ask her who her bias is in person 😊)",
    "talk_title": "TBuilding a Smart Helpdesk: Using Elixir for Social Good",
    "talk_description": "Discover how we built a real-time helpdesk with Elixir to route critical conversations to the right operators instantly. This talk dives into smart routing, leveraging GenServers, and using tech to drive social impact—transforming code into meaningful connections for those in need.",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 7,
    "blobType": 2,
    "titleBlobType": 7,
    "blob_x": "40",
    "blob_x_ff": "40",
    "blob_y": "70",
    "t_blob_x": "40",
    "t_blob_y": "10",
    "m_blob_x": "85",
    "m_blob_x_ff": "85",
    "m_blob_y": "140",
    "image_x": "-130px",
    "image_y": "90px",
    "image_scale": "1.4",
    "image_x_mob": "-170px",
    "image_y_mob": "-20px",
    "image_scale_mob": "1.0",
    "image_x_mob_sm": "-60px",
    "image_y_mob_sm": "40px",
    "image_scale_mob_sm": "1.4",
    "name": "Saša",
    "surname": "Juric",
    "x_link": "https://x.com/sasajuric",
    "git_link": "https://github.com/sasa1977",
    "web_link": "https://medium.com/@sasa.juric",
    "bio": "Saša is a passionate chocolate enthusiast, aspiring latte artist, and wannabe fingerstyle guitarist. When he’s not perfecting his coffee skills or strumming away, he enjoys helping teams make the most of Elixir. He’s the author of Elixir in Action and an occasional blogger at theerlangelist.com.",
    "talk_title": "TBD",
    "talk_description": "",
    "workshop_title": "Practical testing with Elixir (and Phoenix)",
    "workshop_description": "This tutorial teaches a practical testing approach which maximizes the value you can get out of your tests in real-life collaborative Elixir projects. You’ll learn how to increase the confidence in your tests, organically maximize code coverage, and improve the test clarity. This is going to be a very interactive and hands-on session involving a lot of coding and discussions. You'll need to bring a working machine with Erlang, Elixir, and PostgreSQL installed, and an IDE of your choice. You’ll be writing tests for a Phoenix-powered Elixir web server, so it is expected you are familiar with Elixir, Phoenix, Ecto, and ExUnit."
  },
  {
    "id": 8,
    "blobType": 0,
    "titleBlobType": 8,
    "blob_x": "120",
    "blob_x_ff": "120",
    "blob_y": "-100",
    "t_blob_x": "40",
    "t_blob_y": "10",
    "m_blob_x": "75",
    "m_blob_x_ff": "75",
    "m_blob_y": "150",
    "image_x": "-70px",
    "image_y": "140px",
    "image_scale": "1.8",
    "image_x_mob": "-120px",
    "image_y_mob": "20px",
    "image_scale_mob": "1.3",
    "image_x_mob_sm": "-30px",
    "image_y_mob_sm": "40px",
    "image_scale_mob_sm": "1.7",
    "name": "Shannon",
    "surname": "C. Ryan",
    "x_link": "https://x.com/",
    "git_link": "https://github.com/",
    "web_link": "https://",
    "bio": "Vice President of Marketing at Veritas Automata. Creative out-of-the-box thinker and a lover of Lego Plants and kaleidoscopes. Deeply enthusiastic about nurturing growth, whether it's in the realm of technology, personal development, or fostering innovation in the ever-evolving digital industry.",
    "talk_title": "From Code to Leadership: Navigating the Tech Landscape as a Woman",
    "talk_description": "Navigating the tech landscape as a woman comes with unique challenges and opportunities. “From Code to Leadership: Navigating the Tech Landscape as a Woman” offers a comprehensive guide to career growth, leadership development, and the impact of diversity in technology. This presentation provides practical advice for women aspiring to transition from technical roles to leadership positions, emphasizing the importance of continuous learning, mentorship, and building a personal brand.",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 9,
    "blobType": 2,
    "titleBlobType": 9,
    "blob_x": "130",
    "blob_x_ff": "130",
    "blob_y": "120",
    "t_blob_x": "180",
    "t_blob_y": "10",
    "m_blob_x": "200",
    "m_blob_x_ff": "200",
    "m_blob_y": "140",
    "image_x": "-100px",
    "image_y": "-80px",
    "image_scale": "0.8",
    "image_x_mob": "-150px",
    "image_y_mob": "-160px",
    "image_scale_mob": "0.60",
    "image_x_mob_sm": "-90px",
    "image_y_mob_sm": "-80px",
    "image_scale_mob_sm": "0.8",
    "name": "Tobias",
    "surname": "Pfeiffer",
    "x_link": "https://x.com/PragTob",
    "git_link": "https://github.com/PragTob",
    "web_link": "https://www.xing.com/profiles/Tobias_Pfeiffer14",
    "bio": "Tobi is a human, developer, leader, and open-source enthusiast with a passion for benchmarking, Elixir, and Ruby. He deeply values human interactions and believes empathy is essential. Tobi enjoys learning, teaching and sharing knowledge. He loves collaboratively creating just about anything people enjoy - be it meetups, presentations or open source projects such as benchee.",
    "talk_title": "Metaphors are everywhere: Ideas to Improve Software Development",
    "talk_description": "Let’s embark on a journey together - a journey in which we’ll weave together the realms of basketball, fiction writing, game development and trading card games to explore how these seemingly unrelated domains surprisingly intersect with the world of software development, offering fresh perspectives and insights.",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 10,
    "blobType": 1,
    "titleBlobType": 10,
    "blob_x": "0",
    "blob_x_ff": "0",
    "blob_y": "-60",
    "t_blob_x": "10",
    "t_blob_y": "10",
    "m_blob_x": "80",
    "m_blob_x_ff": "80",
    "m_blob_y": "140",
    "image_x": "-90px",
    "image_y": "50px",
    "image_scale": "1.4",
    "image_x_mob": "-140px",
    "image_y_mob": "-40px",
    "image_scale_mob": "1.0",
    "image_x_mob_sm": "-50px",
    "image_y_mob_sm": "10px",
    "image_scale_mob_sm": "1.3",
    "name": "Wojtek",
    "surname": "Mach",
    "x_link": "https://x.com/wojtekmach",
    "git_link": "https://github.com/wojtekmach",
    "web_link": "https://hex.pm/users/wojtekmach",
    "bio": "Wojtek Mach is a developer based in Kraków, Poland. He works at Dashbit helping organisations adopt and run Elixir in production as well as advance the Elixir Open Source ecosystem. He is a member of Hex, Ecto, and ExDoc core teams. He is also the creator of MyXQL, Livebook Desktop, and Req HTTP client.",
    "talk_title": "TBD",
    "talk_description": "",
    "workshop_title": "",
    "workshop_description": ""
  },
  {
    "id": 11,
    "blobType": 0,
    "titleBlobType": 11,
    "blob_x": "-50",
    "blob_x_ff": "-50",
    "blob_y": "150",
    "t_blob_x": "40",
    "t_blob_y": "20",
    "m_blob_x": "80",
    "m_blob_x_ff": "80",
    "m_blob_y": "170",
    "image_x": "-85px",
    "image_y": "-20px",
    "image_scale": "0.95",
    "image_x_mob": "-135px",
    "image_y_mob": "-90px",
    "image_scale_mob": "0.70",
    "image_x_mob_sm": "-70px",
    "image_y_mob_sm": "-20px",
    "image_scale_mob_sm": "0.9",
    "name": "Zach",
    "surname": "Daniel",
    "x_link": "https://x.com/ZachSDaniel1",
    "git_link": "https://github.com/zachdaniel",
    "web_link": "https://www.zachdaniel.dev/",
    "bio": "Zach is the author of the Ash Framework, a resource-oriented declarative design framework for Elixir, and principal platform engineer at Alembic. He has a passion for declarative design, functional programming, and contributing to the open source community. When not programming, he enjoys spending time with his friends and family and studying the Japanese language.",
    "talk_title": "The Next Dimension of Developer Experience",
    "talk_description": "Igniter is an Elixir framework that simplifies package installation and upgrades using AST-based code patching, enabling developers to manage packages with intuitive commands like mix igniter.install and mix igniter.upgrade. This approach streamlines setup, reduces cognitive overhead, and enhances the developer experience by allowing library authors to provide intelligent, standardized installation and upgrade processes. The talk delves into Igniter's capabilities, exploring examples from basic to advanced use cases, its impact on improving workflows for Elixir applications, and its transformative potential for the future of package management.",
    "workshop_title": "Supercharge Your Elixir Apps with Ash",
    "workshop_description": "Ash Framework is a refreshingly different way to craft efficient and maintainable Elixir applications. In this hands-on, interactive course, we’ll dive deep into Ash’s capabilities, exploring how it can streamline your development process and enhance your application’s architecture. Throughout this class, we’ll build a real-world application from the ground up, leveraging Ash’s unique features. You’ll learn to design and implement resources, craft actions that encapsulate your core business logic, and seamlessly integrate APIs and UIs. We’ll also explore advanced topics like custom extensions and strategies for incremental adoption in existing projects."
  }
]
